#include "led.h"
#include "stm32f4xx.h"
#include "delay.h"
#include  "FreeRTOS.h"
#include "task.h"




//LED�� PC0  PC1  PC2
//���ģʽ������
 
void LED_Init(void)
{
//----------PC1-----------------------------------------------------------------
	RCC->AHB1ENR|=1<<2;                       //����gpioʱ��һ�����APB1�� ����ͬ��103��
                        //����λ��1��IO �˿� E ʱ��ʹ�ܣ����ֲᣩ
  GPIOC->MODER &=~(0x3 << 2);          //������ * �ŵĺ��������� ��ͨ��ָ�������ָ��ļĴ�����ַ�е�����
                                        //�������Ч������Ŀ��λ���� 0������λ���ֲ��䡣
  GPIOC->MODER |=(0x1 << 2);          //����������ã�01Ϊͨ�����ģʽ�����ֲ�
	
  GPIOC->OTYPER &=~(0x1 << 1);           //��Ϊ��������Ŀ��Ϊ�Ѿ���0�����Բ���Ҫ��������
//-----------PC2--------------------------------------------------------		
	GPIOC->MODER &=~(0x3 << 4);
	
  GPIOC->MODER |=(0x1 << 4);
	
  GPIOC->OTYPER &=~(0x1 << 2);
//----------PC0-------------------------------------------------------------
  GPIOC->MODER &=~(0x3 << 0);
	
  GPIOC->MODER |=(0x1 << 0);
	
  GPIOC->OTYPER &=~(0x1 << 0);
  
GPIOC->ODR|=1<<1;      //��������ߵ�ƽ   p189
GPIOC->ODR|=1<<2;
GPIOC->ODR|=1<<0;
	
}

void LED_GREEN_ON(void)
{
   
  GPIOC->ODR|=1<<0;    //��������͵�ƽ
	vTaskDelay(pdMS_TO_TICKS(100));
  GPIOC->ODR &= ~(1<<0);   //按位清零该位，关闭 LED
}


void LED_YELLOW_ON(void)
{
 GPIOC->ODR|=1<<1;    //��������͵�ƽ
	//delay_ms(500);
  GPIOC->ODR &= ~(1<<1);   //按位清零该位，关闭 LED
}

void LED_RED_ON(void)
{
  GPIOC->ODR|=1<<2;    //��������͵�ƽ
	//delay_ms(500);
  GPIOC->ODR &= ~(1<<2);   //按位清零该位，关闭 LED

}
	

