#include "stm32f4xx.h"
#include "pwm.h"

//PWMA--PA8   PWMB--PA10

void TIM1_PWMA_CH1_Init(u16 arr1, u16 psc1)    //通道一配置
{  
//----------------GPIO配置------------------------------------------------------
   RCC->AHB1ENR|=1<<0;    //开启gpio时钟  p135
   
   GPIOA->MODER &=~(0x3 << 16);  //清零端口

   GPIOA->MODER |=(0x2 << 16); //配置gpio端口模式  p187
   
   GPIOA->AFR[1]&= ~(0xF << 0);  // 清零PA8的AFR位 （PA8对应AFR[1]的bit0~3）
                              //模式切换 + 外设选择
   GPIOA->AFR[1] |= (0x1 << 0);   // PA8复用为TIM1_CH1（AF1）  P191

   GPIOA->OSPEEDR |= (0x3<<16);   // 设置高速输出模式
   
   GPIOA->OTYPER &=~(0x1 << 8);   //配置输出类型   p187

   GPIOA->PUPDR &=~(0x3 << 16);  //清零端口
   
   GPIOA->PUPDR|=1<<16;           //配置上拉电阻  p188
//-----------------TIM配置-------------------------------------------------------
   RCC->APB2ENR|=1<<0;      //开启外设时钟使能寄存器  p144

   TIM1->CCER  |= 1 << 0;//通道一输出使能   p381

   TIM1->CCMR1 &= ~(0x7 << 4);    // 清零通道一

   TIM1->CCMR1 |= 6 << 4;//CH1 PWM1模式     P375
   
   TIM1->CCMR1 |= 1 << 3;//CH1预装载使能    p375
   
   TIM1->ARR = arr1;//设定计数器自动重装值(决定PWM的频率)

   TIM1->PSC = psc1;//预分频器 0为不分频  P383
   
   TIM1->CR1 |= (1<<7);    // 自动重装载预装载使能   P366

   TIM1->CCR1 = 0;   // 初始占空比为0

   TIM1->BDTR |= (1<<15); // 高级定时器特有，开启主输出使能，否则无PWM输出   P386

   TIM1->EGR |= 1 << 0; //重新初始化计数器并生成一个寄存器更新事件。p374
   
   TIM1->CR1|=1<<0;      //使能计数器，只有事先通过软件将 CEN 位置 1，才可以使用外部时钟


}


void TIM1_PWMB_CH3_Init(u16 arr2, u16 psc2)    //通道三配置
{  
//----------------GPIO配置------------------------------------------------------
   RCC->AHB1ENR|=1<<0;    //开启gpio时钟  p135
   
   GPIOA->MODER &=~(0x3 << 20);  //清零端口

   GPIOA->MODER |=(0x2 << 20); //配置gpio端口模式  p187
   
   GPIOA->AFR[1]&= ~(0xF << 8);  // 清零PA10的AFR位

   GPIOA->AFR[1]|= (0x1 << 8);   // PA10复用为TIM1_CH3（AF1）  P191

   GPIOA->OSPEEDR |= (0x3<<20);   // 设置高速输出模式
   
   GPIOA->OTYPER &=~(0x1 << 10);   //配置输出类型   p187
   
   GPIOA->PUPDR &=~(0x3 << 20);  //清零端口

   GPIOA->PUPDR|=1<<20;           //配置上拉电阻  p188
//-----------------TIM配置-------------------------------------------------------
   RCC->APB2ENR|=1<<0;      //开启外设时钟使能寄存器  p144

   TIM1->CCER  |= 1 << 8;//通道三输出使能   p381

   TIM1->CCMR2 &= ~(0x7 << 4);   // 清零通道三

   TIM1->CCMR2 |= 6 << 4;//CH3 PWM1模式     P375
   
   TIM1->CCMR2 |= 1 << 3;//CH3预装载使能    p375
   
   TIM1->ARR = arr2;//设定计数器自动重装值(决定PWM的频率)

   TIM1->PSC = psc2;//预分频器 0为不分频  P383
   
   TIM1->CR1 |= (1<<7);    // 自动重装载预装载使能   P366
 
   TIM1->BDTR |= (1<<15); // 高级定时器特有，开启主输出使能，否则无PWM输出   P386

   TIM1->CCR3 = 0;   // 初始占空比为0
   
   TIM1->EGR |= 1 << 0; //重新初始化计数器并生成一个寄存器更新事件。p374
   
   TIM1->CR1|=1<<0;      //使能计数器，只有事先通过软件将 CEN 位置 1，才可以使用外部时钟

}
